{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Banking",
    "1": "Billing",
    "2": "Customer Service",
    "3": "Damaged_Product",
    "4": "Delivery",
    "5": "Delivery_Delay",
    "6": "Food",
    "7": "Fraud",
    "8": "Logistics",
    "9": "Missing Items",
    "10": "Payment",
    "11": "Payment_Issue",
    "12": "Product",
    "13": "Product Quality",
    "14": "Quality",
    "15": "Quality Issue",
    "16": "Refund",
    "17": "Return",
    "18": "Returns",
    "19": "Service",
    "20": "Staff Behavior",
    "21": "Subscription",
    "22": "Technical",
    "23": "Technical Issue",
    "24": "Technical_Issue",
    "25": "Travel",
    "26": "Wrong_Product",
    "27": "account_access",
    "28": "account_issue",
    "29": "app_issue",
    "30": "banking_issue",
    "31": "billing_error",
    "32": "billing_issue",
    "33": "cancellation_issue",
    "34": "customer_service",
    "35": "customer_service_issue",
    "36": "damaged_product",
    "37": "delivery_delay",
    "38": "delivery_issue",
    "39": "delivery_personnel",
    "40": "food_quality",
    "41": "fraud",
    "42": "fraud_issue",
    "43": "fraudulent_activity",
    "44": "kyc_issue",
    "45": "login_issue",
    "46": "logistics_issue",
    "47": "missing_item",
    "48": "network_issue",
    "49": "payment_failed",
    "50": "payment_failure",
    "51": "payment_issue",
    "52": "product_damage",
    "53": "product_defect",
    "54": "product_issue",
    "55": "product_mismatch",
    "56": "product_quality",
    "57": "product_quality_issue",
    "58": "promo_issue",
    "59": "promotion_issue",
    "60": "promotional_issue",
    "61": "quality_issue",
    "62": "refund_delay",
    "63": "refund_issue",
    "64": "refund_request",
    "65": "return_issue",
    "66": "safety_issue",
    "67": "service_delay",
    "68": "service_disruption",
    "69": "service_issue",
    "70": "service_outage",
    "71": "staff_behavior",
    "72": "subscription_issue",
    "73": "tech_issue",
    "74": "technical_glitch",
    "75": "technical_issue",
    "76": "theft_issue",
    "77": "travel_issue",
    "78": "utility_issue",
    "79": "warranty_issue",
    "80": "wrong_item",
    "81": "wrong_product",
    "82": "wrong_size"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Banking": 0,
    "Billing": 1,
    "Customer Service": 2,
    "Damaged_Product": 3,
    "Delivery": 4,
    "Delivery_Delay": 5,
    "Food": 6,
    "Fraud": 7,
    "Logistics": 8,
    "Missing Items": 9,
    "Payment": 10,
    "Payment_Issue": 11,
    "Product": 12,
    "Product Quality": 13,
    "Quality": 14,
    "Quality Issue": 15,
    "Refund": 16,
    "Return": 17,
    "Returns": 18,
    "Service": 19,
    "Staff Behavior": 20,
    "Subscription": 21,
    "Technical": 22,
    "Technical Issue": 23,
    "Technical_Issue": 24,
    "Travel": 25,
    "Wrong_Product": 26,
    "account_access": 27,
    "account_issue": 28,
    "app_issue": 29,
    "banking_issue": 30,
    "billing_error": 31,
    "billing_issue": 32,
    "cancellation_issue": 33,
    "customer_service": 34,
    "customer_service_issue": 35,
    "damaged_product": 36,
    "delivery_delay": 37,
    "delivery_issue": 38,
    "delivery_personnel": 39,
    "food_quality": 40,
    "fraud": 41,
    "fraud_issue": 42,
    "fraudulent_activity": 43,
    "kyc_issue": 44,
    "login_issue": 45,
    "logistics_issue": 46,
    "missing_item": 47,
    "network_issue": 48,
    "payment_failed": 49,
    "payment_failure": 50,
    "payment_issue": 51,
    "product_damage": 52,
    "product_defect": 53,
    "product_issue": 54,
    "product_mismatch": 55,
    "product_quality": 56,
    "product_quality_issue": 57,
    "promo_issue": 58,
    "promotion_issue": 59,
    "promotional_issue": 60,
    "quality_issue": 61,
    "refund_delay": 62,
    "refund_issue": 63,
    "refund_request": 64,
    "return_issue": 65,
    "safety_issue": 66,
    "service_delay": 67,
    "service_disruption": 68,
    "service_issue": 69,
    "service_outage": 70,
    "staff_behavior": 71,
    "subscription_issue": 72,
    "tech_issue": 73,
    "technical_glitch": 74,
    "technical_issue": 75,
    "theft_issue": 76,
    "travel_issue": 77,
    "utility_issue": 78,
    "warranty_issue": 79,
    "wrong_item": 80,
    "wrong_product": 81,
    "wrong_size": 82
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
